app/controllers/todos_controller.rb

  def index
    new
    @todos = Todo.all
---
SELECT * FROM `todos`

  def show
    @todo = Todo.find(params[:id])
---
SELECT * FROM `todos` WHERE (`todos`.`id` = 1)

  def edit
    @todo = Todo.find(params[:id])
---
SELECT * FROM `todos` WHERE (`todos`.`id` = 1)

  def create
    @todo = Todo.new(params[:todo])

    if @todo.save
---
INSERT INTO `todos` (`created_at`, `updated_at`, `done`, `text`, `points`, `due`) VALUES('2010-05-24 08:09:09', '2010-05-24 08:09:09', NULL, 'Make it easier to check off items', NULL, NULL)

  def check
    @todo = Todo.find(params[:id])
    @todo.done = true
    @todo.save
---
SELECT * FROM `todos` WHERE (`todos`.`id` = 2)
UPDATE `todos` SET `updated_at` = '2010-05-24 08:24:38', `done` = 1 WHERE `id` = 2

  def uncheck
    @todo = Todo.find(params[:id])
    @todo.done = false
    @todo.save
---
SELECT * FROM `todos` WHERE (`todos`.`id` = 2)
UPDATE `todos` SET `updated_at` = '2010-05-24 08:24:37', `done` = 0 WHERE `id` = 2

  def update
    @todo = Todo.find(params[:id])

    respond_to do |format|
      if @todo.update_attributes(params[:todo])
---
SELECT * FROM `todos` WHERE (`todos`.`id` = 1)
UPDATE `todos` SET `updated_at` = '2010-05-23 07:39:43', `done` = 0, `text` = 'Go to the Standesamt Tuesday' WHERE `id` = 3

  def destroy
    @todo = Todo.find(params[:id])
    @todo.destroy
---
SELECT * FROM `todos` WHERE (`todos`.`id` = 1)
DELETE FROM `todos` WHERE `id` = 1